In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [2]:
stocks = pd.read_csv('all_stocks_2006-01-01_to_2018-01-01.csv')

In [3]:
stocks.head()

         Date   Open   High    Low  Close   Volume Name
0  2006-01-03  77.76  79.35  77.24  79.11  3117200  MMM
1  2006-01-04  79.49  79.49  78.25  78.71  2558000  MMM
2  2006-01-05  78.41  78.65  77.56  77.99  2529500  MMM
3  2006-01-06  78.64  78.90  77.64  78.63  2479500  MMM
4  2006-01-09  78.50  79.83  78.46  79.02  1845600  MMM

In [4]:
stocks.set_index(pd.DatetimeIndex(stocks['Date']), inplace = True)

In [5]:
stocks.sort_index(inplace = True)

In [6]:
stocks.head()

                  Date   Open   High    Low  Close    Volume Name
Date
2006-01-03  2006-01-03  77.76  79.35  77.24  79.11   3117200  MMM
2006-01-03  2006-01-03  39.83  40.36  39.30  40.19  12839400  JPM
2006-01-03  2006-01-03  61.07  61.85  61.05  61.63  10703200  JNJ
2006-01-03  2006-01-03  24.08  24.48  24.00  24.40   9657400  DIS
2006-01-03  2006-01-03  44.85  46.00  44.52  45.99   3843800  TRV

In [7]:
stocks.index

DatetimeIndex(['2006-01-03', '2006-01-03', '2006-01-03', '2006-01-03',
               '2006-01-03', '2006-01-03', '2006-01-03', '2006-01-03',
               '2006-01-03', '2006-01-03',
               ...
               '2017-12-29', '2017-12-29', '2017-12-29', '2017-12-29',
               '2017-12-29', '2017-12-29', '2017-12-29', '2017-12-29',
               '2017-12-29', '2017-12-29'],
              dtype='datetime64[ns]', name='Date', length=93612, freq=None)